---
kind: enumMember
id: F:Autodesk.Revit.UI.ItemSelectionDialogResult.Canceled
enum: Autodesk.Revit.UI.ItemSelectionDialogResult
source: html/2a3540c1-c4d8-50a8-793b-f662188abfca.htm
---
# Autodesk.Revit.UI.ItemSelectionDialogResult.Canceled

The user canceled the prompted dialog. No selected item(s) are available from
 the dialog interfaces.